Revit 2027 API
View3D.ShowGridsOnLevel Method
 This method displays the grid lines in this 3DView on the given Level.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void ShowGridsOnLevel(
	ElementId levelId
)
Public Sub ShowGridsOnLevel (
	levelId As ElementId
)
public:
void ShowGridsOnLevel(
	ElementId^ levelId
)
member ShowGridsOnLevel :
        levelId : ElementId -> unit
Parameters
levelId ElementId
 The id of the Level where grids should be displayed.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
Remarks
 Grids will be displayed only if they intersects Level's plane.
See Also
Reference
View3D Class
Autodesk.Revit.DB Namespace